# Filter Numeric Less Class

Source: https://www.revitapidocs.com/2026/fcdb6568-9715-4292-e903-c73c0b54dd67.htm

---

| Filter Numeric Less Class |
| --- |

Tests whether numeric values from the document are less than a certain value Inheritance Hierarchy System Object
Autodesk.Revit.DB FilterNumericRuleEvaluator
Autodesk.Revit.DB FilterNumericLess

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class FilterNumericLess : FilterNumericRuleEvaluator
```

```
Public Class FilterNumericLess
	Inherits FilterNumericRuleEvaluator
```

```
public ref class FilterNumericLess : public FilterNumericRuleEvaluator
```

```
type FilterNumericLess =
    class
        inherit FilterNumericRuleEvaluator
    end
```
The FilterNumericLess type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericLess | Constructs an instance of FilterNumericLess. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterNumericRuleEvaluator ) |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterNumericRuleEvaluator ) |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | Evaluate(Int64, Int64\) | Derived classes should override this method to implement the desired test. (Inherited from FilterNumericRuleEvaluator ) |
|  | Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines  whether the two given double\-precision values satisfy the desired condition or not. (Inherited from FilterNumericRuleEvaluator ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace